src/CF/Documents/Инвентаризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Инвентаризации</Name>
			<BasedOn>
				<xr:Item>Document.ПоступленияТовара</xr:Item>
				<xr:Item>Document.РасходыТовара</xr:Item>
				<xr:Item>Document.ПеремещенияТовара</xr:Item>
				<xr:Item>Document.КорректировкиИРегистрацияОстатков</xr:Item>
				<xr:Item>Document.УстановкиЦен</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Зарплата</xr:Item>
				<xr:Item>AccumulationRegister.ВаловаяПрибыль</xr:Item>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
				<xr:Item>AccumulationRegister.Деньги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступилоДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбылоДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяВыбытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТовараНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТовараВКоличестве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗаработнойПлате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДенег</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроизводитьОприходованиеИСписаниеЭтимДокументом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходыТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоФакту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРазница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоФакту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРазница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтражениеВЗарплате</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CF/AccumulationRegisters/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>Товары</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СписаниеИлиОприходование</Name>
					<Comment>Списание или оприходование (не приобретение, продажа, возврат или перемещение)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CF/Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/Catalogs/ВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ВидыЦен</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Клиенты</xr:Item>
				<xr:Item>Catalog.Поставщики</xr:Item>
				<xr:Item>Catalog.Склады</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Зависимая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОтБазовойЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаОтБазовогоВидаЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормулыОписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВЦелыхЕдиницах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиДляРасчетаЛьготнойЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьТолькоВБольшуюСторону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/Изображения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Изображения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Договора</xr:Item>
				<xr:Item>Catalog.Клиенты</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Поставщики</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Document.ДвиженияДенег</xr:Item>
				<xr:Item>Document.Инвентаризации</xr:Item>
				<xr:Item>Document.КорректировкиИРегистрацияОстатков</xr:Item>
				<xr:Item>Document.ПеремещенияТовара</xr:Item>
				<xr:Item>Document.ПланыПродаж</xr:Item>
				<xr:Item>Document.ПоступленияТовара</xr:Item>
				<xr:Item>Document.УстановкиЦен</xr:Item>
				<xr:Item>Document.РасходыТовара</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СвязанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОсновноеИзображениеОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаИзображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаИзображения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеИзображения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзображениеВБазеДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПриОтображении</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазмерыКартинок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Documents/Инвентаризации/Forms/ФормаДокумента/Ext/Form/Module.bsl
//sza140121-1311 
//sza130909-1805 : 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	ИспользоватьПодключаемоеОборудование = ПодключаемоеОборудованиеДСервер.ИспользоватьПодключаемоеОборудование();	
	ИспользоватьСложныйМеханизмЦен 		 = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСложныйМеханизмЦенПС");
	УчетЗарплаты 						 = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗарплатыСотрудников");
	ВестиУчетПоСкладу 					 = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам") ;
	УчетДенег 							 = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег") ;
	УчетПоСериям						 = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетПоСериямНоменклатуры");
	
	элементы.ТоварыВводСКоличеством.Видимость = не ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НеПоказыватьКомандуДобавленияНоменклатурыСКоличеством") ;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Не Значениезаполнено(Объект.ХранилищеДенег) Тогда
			Объект.ХранилищеДенег = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ОсновноеХранилищеДенег") ;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Склад ) Тогда
			Объект.Склад = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СкладПоУмолчанию");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Валюта ) Тогда
			Объект.Валюта = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Валюты.ОсновнаяВалюта") ;
		КонецЕсли;
		
		Если УчетЗарплаты
			И НЕ ЗначениеЗаполнено(Объект.ВидЦен ) Тогда
			
			Объект.ВидЦен = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВидЦенДляОтпускаТоваровСобственнымСотрудникам");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидЦен )
			и ЗначениеЗаполнено(Объект.Склад)
			и ЗначениеЗаполнено(Объект.Склад.ВидЦенРеализацииСЭтогоСклада) Тогда
			
			Объект.ВидЦен = Объект.Склад.ВидЦенРеализацииСЭтогоСклада;
		Иначе
			Объект.ВидЦен = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.ВидыЦен.ОсновнойВидЦен") ;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидЦен) Тогда
			Объект.ВидЦен = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВидЦенПриходованияТовараПоУмолчанию") ;
		КонецЕсли;
		
		Объект.Дата = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
		
		ВидЦенПриИзмененииНаСервере();
	КонецЕсли;
	
	Если НЕ учетденег Тогда
		элементы.ДвиженияДенегПоРезультату.Заголовок   = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Комментарий");
		элементы.ОприходованиеИлиРасходДенег.Видимость = Ложь;
	КонецЕсли;
	
	если не Объект.Проведен Тогда		
		ОтразитьВЗаработнойПлатеПриИзмененииНаСервере();	
		ВидЦенПриИзмененииНаСервере();	    	
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("НеМожетМенятьЦены") тогда
		если ЗначениеЗаполнено(объект.ВидЦен) Тогда
			элементы.ВидЦен.Доступность = ложь;	
		КонецЕсли;
		
		элементы.ТоварыЦена.Доступность = Ложь;
	КонецЕсли;
	
	НаименованиеОсновнойВалюты = Справочники.Валюты.ОсновнаяВалюта.Наименование ;
	СерииНоменклатурыВидны 	   = УчетПоСериям И ОбщийМодульТоварСервер.ПроверитьНаличиеСерийНоменклатуры(Объект.Ссылка);
	Элементы.ТоварыСерияНоменклатуры.Видимость = СерииНоменклатурыВидны;
	
	ОбновитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимость()
	
	РазрешитьМеханизмРегистрацииРеализацииЗаСчетПериодическойИнвентаризацииСклада = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("РазрешитьМеханизмРегистрацииРеализацииЗаСчетПериодическойИнвентаризацииСклада", Истина) ;
	Элементы.ЗафиксироватьРезультатыИнвентаризацииВКачествеРеализации.Видимость   = НЕ объект.Проведен И РазрешитьМеханизмРегистрацииРеализацииЗаСчетПериодическойИнвентаризацииСклада;
	ЗначениеЗаполненообъектСвязанныйДокументРеализации = ЗначениеЗаполнено(объект.СвязанныйДокументРеализации);
	Элементы.СвязанныйДокументРеализации.Видимость 	   = ЗначениеЗаполненообъектСвязанныйДокументРеализации;
	Элементы.НеПроизводитьОприходованиеИСписаниеЭтимДокументом.Видимость = НЕ ЗначениеЗаполненообъектСвязанныйДокументРеализации;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводШтрихКода(Команда)
	
	ТекКод = "";
	Если ВвестиШтрихКод(ТекКод) Тогда
		если не ОбработатьПолученныйШКНаСервере(ТекКод) тогда
			ОбщийМодульКлиент.ВыдатьСигнал(ТекКод);
		конецесли;
		
		ПересчитатьДокументНаКлиенте();   	
	КонецЕсли;                              	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПозициюНоменклатуры(НоменклатураВх)
	
	СерияНоменклатуры 	= неопределено;
	
	Если ТипЗнч(НоменклатураВх) = Тип("СправочникСсылка.Номенклатура") Тогда  		
		Номенклатура 	= НоменклатураВх;
		Количество 		= 1;	
		
	Иначе
		Номенклатура	= НоменклатураВх.Номенклатура;
		Количество 		= НоменклатураВх.Количество;
		НоменклатураВх.Свойство("СерияНоменклатуры", СерияНоменклатуры);
		
	КонецЕсли; 
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", Номенклатура);
	если УчетПоСериям Тогда		
		ПараметрыОтбора.Вставить("СерияНоменклатуры", СерияНоменклатуры);		
	КонецЕсли;
	
	СтрокаТовара = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
	если не ДокументЗаблокирован Тогда
		
		Если ОбщийМодульПовтор.ЭтоНабор(Номенклатура) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Нет возможности инвентаризировать Набор номенклатуры.");
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			
		иначе		
			Если СтрокаТовара.Количество() = 0 Тогда
				
				Если УчетПоСериям
					И ЗначениеЗаполнено(СерияНоменклатуры)
					И НЕ СерииНоменклатурыВидны Тогда
					
					СерииНоменклатурыВидны = Истина;		
					Элементы.ТоварыСерияНоменклатуры.Видимость = Истина;	
				КонецЕсли;
				
				СтрокаТовара 		= Объект.Товары.Добавить();	
				СтрокаТовара.Номенклатура = Номенклатура;
				СтрокаТовара.Цена 	= ОбщийМодульСервер.ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, Объект.ВидЦен, Объект.Дата, Истина, , , , , Объект.Ссылка);
				
			иначе
				СтрокаТовара 		= СтрокаТовара[0];
			КонецЕсли;
			
			Если УчетПоСериям
				И ЗначениеЗаполнено(СерияНоменклатуры) Тогда
				
				СтрокаТовара.СерияНоменклатуры = СерияНоменклатуры;
				СтрокаТовара.КоличествоПоФакту = 1;
			Иначе
				СтрокаТовара.КоличествоПоФакту = СтрокаТовара.КоличествоПоФакту + Количество;
			КонецЕсли;						
			
			Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") Тогда
				
				ПроцентСкидки = ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(Номенклатура, строкатовара.количествопофакту, объект.ВидЦен); //акция ном
				если не процентскидки = 0 
					и не СтрокаТовара.Цена = 0 тогда
					
					СтрокаТовара.Цена  = СтрокаТовара.Цена - (СтрокаТовара.Цена / 100 * ПроцентСкидки);	
				КонецЕсли;
			КонецЕсли;
			
			ПересчитатьСтрокуНаСервере(СтрокаТовара);	
			
			Элементы.Товары.ТекущаяСтрока 	= СтрокаТовара.ПолучитьИдентификатор();
			Элементы.Товары.ТекущийЭлемент 	= элементы.ТоварыКоличествоПоФакту;   	
		КонецЕсли;
		
	иначеЕсли НЕ СтрокаТовара.Количество() = 0 Тогда //Встать на строку
		
		СтрокаТовара = СтрокаТовара[0];
		Элементы.Товары.ТекущаяСтрока 	= СтрокаТовара.ПолучитьИдентификатор();
		Элементы.Товары.ТекущийЭлемент 	= элементы.ТоварыКоличествоПоФакту;
		
	КонецЕсли;   	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)	
	ПриИзмененииНоменклатуры() ;	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНоменклатуры() 
	
	СтрокаТовара 		= Элементы.Товары.ТекущиеДанные;
	
	Номенклатура = СтрокаТовара.Номенклатура;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		СтрокаТовара.Цена 	= ОбщийМодульСервер.ПолучитьЦенуНаСервере(Номенклатура, Объект.ВидЦен, Объект.Дата, истина, , , , , Объект.Ссылка) ;//, строкатовара.количествоПоФакту);
		ПроцентСкидки 		= ОбщийМодульСерверПолучитьПроцентСкидкиНаСервере(Номенклатура, строкатовара.количествоПоФакту); //акция ном
		
		Если УчетПоСериям 
			И НЕ СерииНоменклатурыВидны Тогда
			
			ТоварВедетсяПоСериям = ОбщийМодульПовтор.ТоварВедетсяПоСериям(Номенклатура);
			
			Если ТоварВедетсяПоСериям Тогда
				
				СерииНоменклатурыВидны = Истина;		
				Элементы.ТоварыСерияНоменклатуры.Видимость = Истина;	
			КонецЕсли;             	
			
		КонецЕсли;
		
		если не процентскидки = 0 
			и не СтрокаТовара.Цена = 0 тогда
			
			СтрокаТовара.Цена  = СтрокаТовара.Цена - (СтрокаТовара.Цена / 100 * ПроцентСкидки);	
		КонецЕсли;		
	КонецЕсли;
	
	ПерезаполнитьУчетныеДанные(СтрокаТовара);
	ПересчитатьСтроку();
	
КонецПроцедуры //ПриИзмененииНоменклатуры

&НаСервере
Функция   ОбщийМодульСерверПолучитьПроцентСкидкиНаСервере(Номенклатура, Количество)
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") Тогда
		Возврат ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(Номенклатура, Количество, Объект.ВидЦен);
	иначе
		возврат 0;	
	КонецЕсли;
	
КонецФункции 

&наКлиенте
Процедура ПерезаполнитьУчетныеДанные(СтрокаТовара)
	
	Если ЗначениеЗаполнено(СтрокаТовара.номенклатура) Тогда
		
		СтруктураОстатков 			= ПолучитьСтруктуруОстатков(СтрокаТовара.номенклатура, объект.Склад, Объект.Дата, СтрокаТовара.СерияНоменклатуры);
		СтрокаТовара.КоличествоУчет = СтруктураОстатков.КоличествоОстаток;
		СтрокаТовара.СуммаУчет 		= СтруктураОстатков.СуммаОстаток;
		
	КонецЕсли;
	
КонецПроцедуры

функция   ПолучитьСтруктуруОстатков(номенклатура, Склад, Дата, СерияНоменклатуры)
	
	СтруктураОстатков = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыОстатки.КоличествоОстаток,
	|	ТоварыОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(
	|			&ДатаОстатка,
	|			Номенклатура = &Номенклатура
	|				И Склад = &склад
	|				И СерияНоменклатуры = &СерияНоменклатуры) КАК ТоварыОстатки";
	
	Запрос.УстановитьПараметр("ДатаОстатка", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
	Запрос.УстановитьПараметр("склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	КоличествоОстаток 	= 0;
	СуммаОстаток 		= 0;
	Если не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			КоличествоОстаток 	= КоличествоОстаток + ВыборкаДетальныеЗаписи.КоличествоОстаток;
			СуммаОстаток 		= СуммаОстаток + ВыборкаДетальныеЗаписи.СуммаОстаток;
		КонецЦикла;
	конецесли;
	
	СтруктураОстатков.Вставить("КоличествоОстаток", КоличествоОстаток);
	СтруктураОстатков.Вставить("СуммаОстаток", СуммаОстаток);
	
	Возврат СтруктураОстатков;
	
КонецФункции

&НаКлиенте
процедура пересчитатьСтроку(ИзКоличества = Ложь)
	
	СтрокаТовара = Элементы.Товары.ТекущиеДанные;
	Если не СтрокаТовара = Неопределено тогда
		
		Если ИзКоличества
			и УчетПоСериям
			и СтрокаТовара.КоличествоПоФакту > 0
			и значениезаполнено(СтрокаТовара.СерияНоменклатуры) Тогда
			
			СтрокаТовара.КоличествоПоФакту = 1;
		КонецЕсли;
		
		СтрокаТовара.СуммаУчет 			= СтрокаТовара.КоличествоУчет * СтрокаТовара.Цена;
		СтрокаТовара.СуммаПоФакту 		= СтрокаТовара.КоличествоПоФакту * СтрокаТовара.Цена;
		СтрокаТовара.КоличествоРазница 	= СтрокаТовара.КоличествоПоФакту - СтрокаТовара.КоличествоУчет;
		СтрокаТовара.СуммаРазница 		= СтрокаТовара.СуммаПоФакту - СтрокаТовара.суммаУчет;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
процедура пересчитатьСтрокуНаСервере(СтрокаТовара)
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") Тогда
		
		ПроцентСкидки = ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(СтрокаТовара.Номенклатура, строкатовара.количествоПоФакту, объект.видцен ); 
		если не процентскидки = 0 
			и не СтрокаТовара.Цена = 0 тогда
			
			СтрокаТовара.Цена  = СтрокаТовара.Цена - (СтрокаТовара.Цена/100 * ПроцентСкидки);	
		КонецЕсли;                                     	
	КонецЕсли;
	
	Если УчетПоСериям
		И СтрокаТовара.КоличествоПоФакту > 0
		и значениезаполнено(СтрокаТовара.СерияНоменклатуры) Тогда
		
		СтрокаТовара.КоличествоПоФакту = 1;
	КонецЕсли;
	
	СтрокаТовара.СуммаУчет 			= СтрокаТовара.КоличествоУчет * СтрокаТовара.Цена;
	СтрокаТовара.СуммаПоФакту 		= СтрокаТовара.КоличествоПоФакту * СтрокаТовара.Цена;
	СтрокаТовара.КоличествоРазница 	= СтрокаТовара.КоличествоПоФакту - СтрокаТовара.КоличествоУчет;
	СтрокаТовара.СуммаРазница 		= СтрокаТовара.СуммаПоФакту - СтрокаТовара.суммаУчет;
	
КонецПроцедуры

&НаКлиенте
Функция   ВвестиШтрихКод(ШтрихКод, ТекстЗаголовка = "") Экспорт
	
	Результат = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ТекстЗаголовка) Тогда
		ТекстЗаголовка = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Введите ШтрихКод");
	КонецЕсли;
	
	ШтрихКод = "";
	Если ВвестиЗначение(ШтрихКод, ТекстЗаголовка) Тогда
		Если Не ПустаяСтрока(ШтрихКод) Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция   ОбработатьПолученныйШКНаСервере(ТекКод, Количество = 1)
	
	Результат = Истина;
	
	РезультатОбработки 	= ОбщийМодульТоварСервер.ПолучитьНоменклатуруПоШтрихКоду(ТекКод, Истина);
	Номенклатура 		= РезультатОбработки.Номенклатура;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ДобавитьПозициюНоменклатуры(РезультатОбработки);
		СтрокаДисплеяПокупателя = РезультатОбработки;		
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Товар по Штрих-Коду не найден(") + ТекКод + ").");
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьДокументНаКлиенте()
	
	Объект.ТовараНаСумму 		= Объект.Товары.Итог("СуммаРазница");
	Объект.ТовараВКоличестве 	= Объект.Товары.Итог("КоличествоРазница");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                              // ПРИ ЗАКРЫТИИ   	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		
		ПоддерживаемыеТипыВО = Новый Массив ();
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		ПоддерживаемыеТипыВО.Добавить("ДисплейПокупателя");
		МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование"
		И ВводДоступен() Тогда
		
		Если НЕ СканерЗаблокирован
			И ИмяСобытия = "ScanData" Тогда
			
			Если Параметр[ 1 ] = Неопределено Тогда
				ТекКод = Параметр[ 0 ];
			Иначе
				ТекКод = Параметр[ 1 ][ 1 ];
			КонецЕсли;
			
			ОбработатьПолученныйШКНаКлиенте(ТекКод);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныйШКНаклиенте(ТекКод)
	
	если не ОбработатьПолученныйШКНаСервере(ТекКод) тогда
		
		СканерЗаблокирован = ОбщийМодульКлиент.ВыдатьСигнал(ТекКод) и не ДокументЗаблокирован;
		элементы.разблокироватьсканер.видимость = СканерЗаблокирован;
		
	Иначе
		ПересчитатьСтроку();
	конецесли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПоФактуПриИзменении(Элемент)
	ПересчитатьСтроку(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоРазницаПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПоФактуПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаразницаПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ДеньгиПоРезультату(Команда)
	ДеньгиПоРезультатуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДеньгиПоРезультатуНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ВидЦен)
		и ЗначениеЗаполнено(Объект.ВидЦен.ВалютаЦены) Тогда
		
		Объект.Валюта = Объект.ВидЦен.ВалютаЦены;
	КонецЕсли;
	
	Если УчетЗарплаты
		И Объект.ОтразитьВЗаработнойПлате Тогда
		
		СуммаРазница = ОбщийМодульСервер.ПоКурсу(Объект.Товары.Итог("СуммаРазница"), , Объект.Валюта, Объект.Дата);	//к основной валюте
		
		Объект.ОтражениеВЗарплате.Очистить();
		Если ВестиУчетПоСкладу
			и ЗначениеЗаполнено(объект.Склад)
			и ЗначениеЗаполнено(объект.Склад.ОтветственныйСотрудник) Тогда
			
			СтрокаОтражения = Объект.ОтражениеВЗарплате.Добавить();
			СтрокаОтражения.Сотрудник = объект.Склад.ОтветственныйСотрудник;	
			
		иначе
			Сотрудники = Справочники.Сотрудники.Выбрать() ;
			
			Пока Сотрудники.Следующий() Цикл
				Если Не Сотрудники.ПометкаУдаления Тогда
					СтрокаОтражения = Объект.ОтражениеВЗарплате.Добавить();
					СтрокаОтражения.Сотрудник = Сотрудники.Ссылка;	
				КонецЕсли;
			КонецЦикла;	
			
		КонецЕсли;
		
		КоличествоСотрудников = Объект.ОтражениеВЗарплате.Количество();
		Если КоличествоСотрудников = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В справочнике нет сотрудников!");
			Сообщение.Поле 	= "ДеньгиПоРезультату";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			
		Иначе
			СуммаНаКаждого = СуммаРазница / КоличествоСотрудников;
			Для Каждого СтрокаОтраженияВЗП Из Объект.ОтражениеВЗарплате Цикл
				СтрокаОтраженияВЗП.Сумма = СуммаНаКаждого;
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		СуммаРазница = ОбщийМодульСервер.ПоКурсу(Объект.Товары.Итог("СуммаРазница"), Объект.Валюта, , Объект.Дата);
		
		Если СуммаРазница > 0 Тогда
			Объект.ВыбылоДенег 		= СуммаРазница;
			Объект.ПоступилоДенег 	= 0;
			Если НЕ ЗначениеЗаполнено(Объект.СтатьяВыбытия) Тогда
				Объект.СтатьяВыбытия = Справочники.СтатьиДвиженияДенег.ПрочееВыбытиеДенег ;
			КонецЕсли;
			
		иначе
			Объект.ПоступилоДенег 	= -СуммаРазница;
			Объект.ВыбылоДенег 		= 0;
			Если НЕ ЗначениеЗаполнено(Объект.СтатьяПоступления) Тогда
				Объект.СтатьяПоступления = Справочники.СтатьиДвиженияДенег.ПрочееПоступлениеДенег;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчетнымиДанными(Команда)
	
	Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));	
	ЗаполнитьУчетнымиДаннымиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчетнымиДаннымиНаСервере()
	
	Объект.Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыОстатки.СуммаОстаток,
	|	ТоварыОстатки.КоличествоОстаток,
	|	ТоварыОстатки.Склад,
	|	ТоварыОстатки.Номенклатура,
	|	ТоварыОстатки.СерияНоменклатуры
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(
	|			&ДатаОстатка,
	|			&НетОтбораПоСкладу
	|				ИЛИ Склад = &Склад) КАК ТоварыОстатки";
	
	Запрос.УстановитьПараметр("НетОтбораПоСкладу", не ВестиУчетПоСкладу ИЛИ Не ЗначениеЗаполнено(объект.Склад));
	Запрос.УстановитьПараметр("Склад", объект.Склад);
	Запрос.УстановитьПараметр("ДатаОстатка", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			строкатовары = Объект.Товары.Добавить();
			строкатовары.Номенклатура 		= ВыборкаДетальныеЗаписи.номенклатура;
			строкатовары.СерияНоменклатуры 	= ВыборкаДетальныеЗаписи.СерияНоменклатуры;
			строкатовары.КоличествоУчет 	= ВыборкаДетальныеЗаписи.КоличествоОстаток;			
			строкатовары.цена 				= ОбщийМодульСервер.ПолучитьЦенуНаСервере(строкатовары.Номенклатура, Объект.ВидЦен, Объект.Дата, , , , , , Объект.Ссылка);
			ПересчитатьСтрокуНаСервере(строкатовары);
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоНоменклатурнойГруппе(Команда)
	
	ФормаНоменклатурнойГруппы = ПолучитьФорму("Справочник.НоменклатурныеГруппы.ФормаВыбора");
	ФормаНоменклатурнойГруппы.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Номенклатурную Группу для добавления её номенклатуры в инвентаризацию: ");
	
	НоменклатурнаяГруппа = ФормаНоменклатурнойГруппы.ОткрытьМодально();
	Если ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));
		ДобавитьПоНоменклатурнойГруппеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоНоменклатурнойГруппеНаСервере()	
	ДобавитьПо(2);	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
	
	Если Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы готовы очистить таблицу документа?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ОчиститьТаблицуНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТаблицуНаСервере()
	
	Объект.Товары.Очистить();
	Объект.ТовараВКоличестве = 0;
	Объект.ТовараНаСумму 	 = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоПроизводителю(Команда)
	
	ФормаВыбораПроизводителя = ПолучитьФорму("Справочник.Производители.ФормаВыбора");
	ФормаВыбораПроизводителя.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Производителя для добавления его номенклатуры в инвентаризацию: ");
	
	Производитель = ФормаВыбораПроизводителя.ОткрытьМодально();
	Если ЗначениеЗаполнено(Производитель) Тогда
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));
		ДобавитьПоПроизводителюНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоПроизводителюНаСервере() 	
	ДобавитьПо(1);	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоГруппеНоменклатуры(Команда)
	
	ФормаВыбораГруппыНоменклатуры = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбораГруппы");
	ФормаВыбораГруппыНоменклатуры.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Группу номенклатуры для добавления в инвентаризацию: ");
	
	ГруппаНоменклатуры = ФормаВыбораГруппыНоменклатуры.ОткрытьМодально();
	Если ЗначениеЗаполнено(ГруппаНоменклатуры) Тогда
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));
		ДобавитьПогруппеНоменклатурыНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПо(Режим = 0 )
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыОстатки.Номенклатура,
	|	ТоварыОстатки.СерияНоменклатуры,
	|	ТоварыОстатки.КоличествоОстаток,
	|	ТоварыОстатки.СуммаОстаток,
	|	ТоварыОстатки.Номенклатура.Цена КАК Цена
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(
	|			&Дата,
	|			НЕ &ОтборПоСкладу
	|				ИЛИ Склад = &Склад) КАК ТоварыОстатки
	|ГДЕ
	|	ТоварыОстатки.КоличествоОстаток <> 0";
	
	если режим = 0 тогда
		Запрос.Текст = Запрос.Текст +" И ТоварыОстатки.Номенклатура.Родитель = &Родитель ";		
		Запрос.УстановитьПараметр("Родитель", ГруппаНоменклатуры);	
		
	иначеесли режим = 1 тогда
		Запрос.Текст = Запрос.Текст +" И ТоварыОстатки.Номенклатура.Производитель = &Производитель ";		
		Запрос.УстановитьПараметр("производитель", производитель);	
		
	иначеесли режим = 2 тогда
		Запрос.Текст = Запрос.Текст +" И ТоварыОстатки.Номенклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппа ";		
		Запрос.УстановитьПараметр("НоменклатурнаяГруппа", НоменклатурнаяГруппа);	
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склад", объект.Склад);
	Запрос.УстановитьПараметр("ОтборПоСкладу", ВестиУчетПоСкладу и ЗначениеЗаполнено(объект.Склад));
	Запрос.УстановитьПараметр("Дата", объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			если УчетПоСериям тогда
				СтруктураОтбора.Вставить("СерияНоменклатуры", ВыборкаДетальныеЗаписи.СерияНоменклатуры);
			конецесли;
			
			если Объект.Товары.НайтиСтроки(СтруктураОтбора).Количество() = 0 Тогда
				НоваяСтрока = Объект.Товары.Добавить();
				НоваяСтрока.номенклатура 		= ВыборкаДетальныеЗаписи.Номенклатура;
				НоваяСтрока.СерияНоменклатуры 	= ВыборкаДетальныеЗаписи.СерияНоменклатуры;				
				КоличествоОстаток 				= ВыборкаДетальныеЗаписи.КоличествоОстаток;
				
				если не КоличествоОстаток = 0 тогда
					НоваяСтрока.КоличествоУчет 	= КоличествоОстаток;
					НоваяСтрока.Цена 			= ВыборкаДетальныеЗаписи.СуммаОстаток / КоличествоОстаток;
				КонецЕсли;
				
				если НоваяСтрока.Цена = 0 тогда
					Если ИспользоватьСложныйМеханизмЦен Тогда
						НоваяСтрока.Цена = ОбщийМодульСервер.ПолучитьСложнуюЦену(НоваяСтрока.номенклатура, Объект.ВидЦен, Объект.Дата);
					иначе
						НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.Цена;
					КонецЕсли;                     	
				КонецЕсли;
				
				НоваяСтрока.СуммаУчет = ВыборкаДетальныеЗаписи.СуммаОстаток;
				ПересчитатьСтрокуНаСервере(НоваяСтрока);		
				
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры //ДобавитьПо

&НаСервере
Процедура ДобавитьПоГруппеНоменклатурыНаСервере()	
	ДобавитьПо(0);	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуруСОтрицательнымиОстатками(Команда)
	
	Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));
	ДобавитьНоменклатуруСОтрицательнымиОстаткамиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруСОтрицательнымиОстаткамиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыОстатки.Номенклатура,
	|	ТоварыОстатки.КоличествоОстаток,
	|	ТоварыОстатки.Номенклатура.Цена КАК Цена,
	|	ТоварыОстатки.СерияНоменклатуры
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(
	|			&ДатаОстатка,
	|			&НетОтбораПоСкладу
	|				ИЛИ Склад = &Склад) КАК ТоварыОстатки
	|ГДЕ
	|	ТоварыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("НетОтбораПоСкладу", не ВестиУчетПоСкладу ИЛИ Не ЗначениеЗаполнено(объект.Склад));
	Запрос.УстановитьПараметр("Склад", объект.Склад);
	Запрос.УстановитьПараметр("ДатаОстатка", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			Если УчетПоСериям Тогда
				СтруктураОтбора.Вставить("СерияНоменклатуры", ВыборкаДетальныеЗаписи.СерияНоменклатуры);
			КонецЕсли;
			
			СтрокиДокумента = Объект.Товары.НайтиСтроки(СтруктураОтбора);			
			если СтрокиДокумента.Количество() = 0 Тогда
				
				НоваяСтрока = Объект.Товары.Добавить();
				НоваяСтрока.номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
				
				Если ИспользоватьСложныйМеханизмЦен Тогда
					НоваяСтрока.Цена = ОбщийМодульСервер.ПолучитьСложнуюЦену(НоваяСтрока.номенклатура, Объект.ВидЦен, Объект.Дата);
				иначе
					НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.Цена;
				КонецЕсли;
				
				НоваяСтрока.КоличествоУчет = ВыборкаДетальныеЗаписи.КоличествоОстаток;
				ПересчитатьСтрокуНаСервере(НоваяСтрока);
				
			Иначе
				ТакаяСтрока = СтрокиДокумента[0];
				ТакаяСтрока .КоличествоУчет = ВыборкаДетальныеЗаписи.КоличествоОстаток;				
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуруДругогоДокумента(Команда)
	
	СписокТиповДокументов = Новый СписокЗначений;
	СписокТиповДокументов.Добавить("Корректировки И Регистрация Остатков");
	СписокТиповДокументов.Добавить("Инвентаризации");
	СписокТиповДокументов.Добавить("Расходы Товара");
	СписокТиповДокументов.Добавить("Поступления Товара");
	СписокТиповДокументов.Добавить("Перемещения Товара");
	СписокТиповДокументов.Добавить("Установки Цен");
	СписокТиповДокументов.Добавить("Планы продаж");
	
	ТипДокументаДляДобавления = ВыбратьИзСписка(СписокТиповДокументов, , СписокТиповДокументов[0]);
	
	если не ТипДокументаДляДобавления = Неопределено тогда
		ТипДокументаДляДобавления = стрзаменить(ТипДокументаДляДобавления, " ", "");
		
		ФормаВыбораДокумента = ПолучитьФорму("Документ." + ТипДокументаДляДобавления + ".ФормаВыбора");
		
		ФормаВыбораДокумента.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Документ для добавления его номенклатуры в Инвентаризацию: ");
		ДругойДокумент = ФормаВыбораДокумента.ОткрытьМодально();
		
		Если ЗначениеЗаполнено(ДругойДокумент) Тогда
			Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));
			ДобавитьНоменклатуруДругогоДокументаНаСервере();      	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруДругогоДокументаНаСервере()
	
	Если ЗначениеЗаполнено(ДругойДокумент) Тогда		
		
		Объект.Товары.Загрузить(ДругойДокумент.Товары.Выгрузить());
		ТаблицаОстатков = ОбщийМодульСервер.СформироватьТаблицуОстатков(объект.Ссылка, Объект.Склад, Объект.Дата);
		
		Для Каждого строкаТовара из ТаблицаОстатков Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", строкаТовара.Номенклатура);			
			Если УчетПоСериям Тогда
				СтруктураОтбора.Вставить("СерияНоменклатуры", строкаТовара.СерияНоменклатуры);
			КонецЕсли;
			
			СтрокиДокумента = Объект.Товары.НайтиСтроки(СтруктураОтбора);			
			если НЕ СтрокиДокумента.Количество() = 0 Тогда
				СтрокаДокумента = СтрокиДокумента[0];
				
				СтрокаДокумента.КоличествоУчет = строкаТовара.КоличествоОстатка;
				ПересчитатьСтрокуНаСервере(СтрокаДокумента);		
			конецесли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьУчетныеДанныеВсехСтрок(Команда)
	
	Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));	
	ОбновитьУчетныеДанныеВсехСтрокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьУчетныеДанныеВсехСтрокНаСервере()
	
	ТаблицаОстатков = ОбщийМодульСервер.СформироватьТаблицуОстатков(объект.Ссылка, Объект.Склад, Объект.Дата);
		Для Каждого строкаТовара из ТаблицаОстатков Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", строкаТовара.Номенклатура);			
			Если УчетПоСериям Тогда
				СтруктураОтбора.Вставить("СерияНоменклатуры", строкаТовара.СерияНоменклатуры);
			КонецЕсли;
			
			СтрокиДокумента = Объект.Товары.НайтиСтроки(СтруктураОтбора);			
			если НЕ СтрокиДокумента.Количество() = 0 Тогда
				СтрокаДокумента = СтрокиДокумента[0];
				
				СтрокаДокумента.КоличествоУчет = строкаТовара.КоличествоОстатка;
				ПересчитатьСтрокуНаСервере(СтрокаДокумента);		
			конецесли;
		КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	если НЕ ПараметрыЗаписи.режимзаписи = РежимЗаписиДокумента.Запись тогда
		ОбработатьБлокировку();                                                	
	КонецЕсли;
	ОбновитьВидимость();
	
КонецПроцедуры	

&НаСервере
Процедура ОбработатьБлокировку(ПриСозданииФормы = ложь)
	
	Если ОбщийМодульСервер.ОбработатьБлокировку(Объект, ЭтаФорма, ПриСозданииФормы) Тогда			
		Элементы.ТоварыВводШтрихКода.Доступность 	= Ложь;
		Элементы.ДеньгиПоРезультату.Доступность 	= Ложь;
		Элементы.ОбработкаТаблицы.Доступность 		= Ложь;
		Элементы.ТоварыВводСКоличеством.Доступность = Ложь;
		Элементы.Декорация2.Видимость 				= истина;
		Элементы.ЗафиксироватьРезультатыИнвентаризацииВКачествеРеализации.Доступность = Ложь;
		
	Иначе
		Элементы.ТоварыВводШтрихКода.Доступность 	= Истина;
		Элементы.ДеньгиПоРезультату.Доступность 	= Истина;
		Элементы.ОбработкаТаблицы.Доступность 		= Истина;
		Элементы.ТоварыВводСКоличеством.Доступность = Истина;
		Элементы.Декорация2.Видимость 				= ложь;
		Элементы.ЗафиксироватьРезультатыИнвентаризацииВКачествеРеализации.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Объект.Ссылка, истина);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработатьБлокировку(истина);		
	КонецЕсли;
	
	Если ИспользоватьПодключаемоеОборудование И 
		МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		ОписаниеОшибки = "" ;
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке( "При подключении оборудования произошла ошибка:") + " " + ОписаниеОшибки + ".";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте                             
Процедура СкладПриИзменении(Элемент)	
	
	СкладПриИзмененииНаСервере();
	
	Если Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Заполнить учетными данными?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ЗаполнитьУчетнымиДаннымиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		
		Если ЗначениеЗаполнено(Объект.Склад.ВидЦенРеализацииСЭтогоСклада) Тогда			
			Объект.ВидЦен = Объект.Склад.ВидЦенРеализацииСЭтогоСклада;             
		конецесли;
		
		если УчетЗарплаты тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СотрудникиСклады.Ссылка
			|ИЗ
			|	Справочник.Сотрудники.Склады КАК СотрудникиСклады
			|ГДЕ
			|	СотрудникиСклады.Склад = &Склад";
			
			Запрос.УстановитьПараметр("Склад", Объект.Склад);
			
			РезультатЗапроса = Запрос.Выполнить();
			если не РезультатЗапроса.Пустой() тогда
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Сотрудник", ВыборкаДетальныеЗаписи.Ссылка);
					
					СтрокаСотрудника = Объект.ОтражениеВЗарплате.НайтиСтроки(ПараметрыОтбора);
					если СтрокаСотрудника.Количество() = 0 тогда
						СтрокаСотрудника = объект.ОтражениеВЗарплате.Добавить();
						СтрокаСотрудника.Сотрудник = ВыборкаДетальныеЗаписи.Ссылка;
					иначе
						СтрокаСотрудника = СтрокаСотрудника[0];
					КонецЕсли;
					
				КонецЦикла;
			конецесли;
			
		конецесли; 		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)	
	ВидЦенПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ВидЦенПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ВидЦен)
		и ЗначениеЗаполнено(Объект.ВидЦен.ВалютаЦены) Тогда
		
		Объект.Валюта = Объект.ВидЦен.ВалютаЦены;		
	КонецЕсли;
	
	Для Каждого строкаТовара из Объект.Товары Цикл
		строкаТовара.цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(строкаТовара.Номенклатура, Объект.ВидЦен, Объект.Дата, , , , , , Объект.Ссылка);
		ПересчитатьСтрокуНаСервере(строкаТовара);		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ПоискОшибкиКодировки("Номенклатура", ДанныеВыбора, Текст, Элементы.Товары.ТекущиеДанные.Номенклатура);
	
	Если ЗначениеЗаполнено(ДанныеВыбора) Тогда
		ПриИзмененииНоменклатуры() 	;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВЗаработнойПлатеПриИзменении(Элемент)
	ОтразитьВЗаработнойПлатеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтразитьВЗаработнойПлатеПриИзмененииНаСервере()
	
	Если УчетЗарплаты
		И Объект.ОтразитьВЗаработнойПлате Тогда
		
		Элементы.ОприходованиеИлиРасходДенег.Видимость 		= Ложь;
		Элементы.ИлиУчестьВЗарплатеСотрудников.Видимость 	= Истина;
		
	Иначе
		Элементы.ОприходованиеИлиРасходДенег.Видимость 		= Истина;
		Элементы.ИлиУчестьВЗарплатеСотрудников.Видимость 	= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	Если ИспользоватьСложныйМеханизмЦен
		и ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		
		ПараметрыФормы.Вставить("ВидЦен", Объект.ВидЦен);
	КонецЕсли;	
	
	Если ВестиУчетПоСкладу
		и ЗначениеЗаполнено(Объект.Склад) Тогда
		
		ПараметрыФормы.Вставить("ОтборПоСкладу", Объект.Склад);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ОтборПоДате", Объект.Дата);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Элементы.Товары.ТекущиеДанные.Номенклатура);
	ФормаВыбора = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы);
	
	Номенклатура = ФормаВыбора.ОткрытьМодально();
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Элементы.Товары.ТекущиеДанные.Номенклатура = Номенклатура;	
		
		ПриИзмененииНоменклатуры() ;
		элементы.Товары.ЗакончитьРедактированиеСтроки(лОЖЬ);
		Элементы.Товары.ТекущийЭлемент = элементы.ТоварыКоличествоПоФакту;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводСКоличеством(Команда)
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПоддерживаемыеТипыВО = Новый Массив ();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	КонецЕсли;
	
	СтруктураДляВВода = Новый Структура;
	СтруктураДляВВода.Вставить("Дата", Объект.Дата);
	СтруктураДляВВода.Вставить("ВидЦен", Объект.ВидЦен);
	СтруктураДляВВода.Вставить("Склад", Объект.Склад);
	СтруктураДляВВода.Вставить("ЭтоДобавка", Истина);
	СтруктураДляВВода.Вставить("БлокВидаЦенИЦены", Истина);
	
	СтруктураПараметров = ОбщийМодульКлиент.ВвестиНоменклатуруИКоличество(СтруктураДляВВода);	
	
	Если НЕ СтруктураПараметров = Неопределено Тогда
		ДобавитьПозициюНоменклатуры(СтруктураПараметров);
		ПересчитатьДокументНаКлиенте();
		ЭтаФорма.ТекущийЭлемент = Элементы.Товары;
	КонецЕсли;
	
	Если ИспользоватьПодключаемоеОборудование И 
		МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		ОписаниеОшибки = "" ;
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке( "При подключении оборудования произошла ошибка:") + " " + ОписаниеОшибки + ".";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиВКоторыхНетРазницы(Команда)
	УдалитьСтрокиВКоторыхНетРазницыНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиВКоторыхНетРазницыНаСервере()
	
	МассивСтрок = новый Массив;
	для каждого строкаТовара из объект.Товары Цикл
		Если строкатовара.КоличествоРазница = 0 Тогда
			МассивСтрок.добавить(строкатовара);
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого СтрокаТовара из МассивСтрок Цикл
		Объект.Товары.Удалить(СтрокаТовара);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоПоФактуДаннымиИзУчетаДляВсехСтрокГдеФактНеУказан(Команда)
	ЗаполнитьКоличествоПоФактуДаннымиИзУчетаДляВсехСтрокГдеФактНеУказанНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоПоФактуДаннымиИзУчетаДляВсехСтрокГдеФактНеУказанНаСервере()
	
	для каждого строкаТовара из объект.Товары Цикл
		Если строкатовара.КоличествоПоФакту = 0 Тогда
			
			строкатовара.КоличествоПоФакту 	= строкатовара.КоличествоУчет;
			СтрокаТовара.СуммаУчет 			= СтрокаТовара.КоличествоУчет * СтрокаТовара.Цена;
			СтрокаТовара.СуммаПоФакту 		= СтрокаТовара.КоличествоПоФакту * СтрокаТовара.Цена;
			СтрокаТовара.КоличествоРазница 	= СтрокаТовара.КоличествоПоФакту - СтрокаТовара.КоличествоУчет;
			СтрокаТовара.СуммаРазница 		= СтрокаТовара.СуммаПоФакту - СтрокаТовара.суммаУчет;	
			
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если УчетПоСериям Тогда
		Отказ = ПроверитьУчетПоСериям(Отказ);
	конецесли;
	
	Если НЕ Отказ Тогда
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Запись документа.."));	
	КонецЕсли;
	
	ПодготовкаКПроведению(Отказ);
	глПроверятьСообщения = Истина;

КонецПроцедуры

&НаСервере
Функция   ПроверитьУчетПоСериям(Отказ)
	
	если не отказ тогда
		
		МассивСерий = Новый Массив;
		Для Каждого СтрокаТовара Из Объект.Товары Цикл
			
			СерияНоменклатуры = СтрокаТовара.СерияНоменклатуры;
			Если ЗначениеЗаполнено(СерияНоменклатуры) Тогда
				Если МассивСерий.Найти(СерияНоменклатуры) = Неопределено Тогда
					МассивСерий.Добавить(СерияНоменклатуры);
					
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В строке №") + СтрокаТовара.НомерСтроки + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" Серия повторяется!");
					Сообщение.Поле 	= "ТоварыСерияНоменклатуры";
					Сообщение.УстановитьДанные(Объект);
					Сообщение.Сообщить();
					
					Отказ = Истина;
					
				КонецЕсли;
				
			ИначеЕсли ОбщийМодульПовтор.ТоварВедетсяПоСериямИСерияОбязательна(СтрокаТовара.номенклатура) тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В строке №") + СтрокаТовара.НомерСтроки + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" обязательная Серия НЕ указана!");
				Сообщение.Поле 	= "ТоварыСерияНоменклатуры";
				Сообщение.УстановитьДанные(Объект);
				Сообщение.Сообщить();
				
				Отказ = Истина;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат отказ;
	
КонецФункции //ПроверитьУчетПоСериям

&НаКлиенте
Процедура РазблокироватьСканер(Команда)
	
	СканерЗаблокирован = Ложь;
	элементы.разблокироватьсканер.видимость = СканерЗаблокирован;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеИзображения(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		и Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сначала следует записать этот элемент. Записать?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
		Записать();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("СвязанныйОбъект", Объект.Ссылка);
		ОткрытьФорму("Справочник.Изображения.ФормаСписка", ПараметрыФормы);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	
	Если НЕ ЗначениеЗаполнено(объект.Ссылка) 
		и Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сначала следует записать этот элемент. Записать?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		Записать();			
	КонецЕсли;
		
	Если ЗначениеЗаполнено(объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("СвязанныйОбъект", объект.Ссылка);
		формаИзображения = ПолучитьФорму("Справочник.Изображения.ФормаОбъекта", ПараметрыФормы);	
		формаИзображения.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьРезультатыИнвентаризацииВКачествеРеализации(Команда)
	
	Если ПроверитьНаличиеОприходования()
		И Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Создать расходный документ и заполнить его разницей данных инвентаризации?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		ЗафиксироватьРезультатыИнвентаризацииВКачествеРеализацииНаСервере();
		ОткрытьЗначение(объект.СвязанныйДокументРеализации);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьРезультатыИнвентаризацииВКачествеРеализацииНаСервере()
	
	Объект.НеПроизводитьОприходованиеИСписаниеЭтимДокументом = Истина;
	
	Если ЗначениеЗаполнено(объект.СвязанныйДокументРеализации) Тогда
		объектСвязанныйДокументРеализации = объект.СвязанныйДокументРеализации.ПолучитьОбъект();
		объектСвязанныйДокументРеализации.ПометкаУдаления = Ложь;
	Иначе
		объектСвязанныйДокументРеализации = Документы.РасходыТовара.СоздатьДокумент();
	КонецЕсли;
	
	объектСвязанныйДокументРеализации.Дата = объект.Дата + 1;
	объектСвязанныйДокументРеализации.Валюта = объект.Валюта;
	объектСвязанныйДокументРеализации.ВидДокумента = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Реализация за счет данных инвентаризации");
	объектСвязанныйДокументРеализации.ВидЦен = объект.ВидЦен;
	//объектСвязанныйДокументРеализации.Договор
	объектСвязанныйДокументРеализации.КлиентПоставщик = ПредопределенноеЗначение("Справочник.Клиенты.ФизическоеЛицо");
	объектСвязанныйДокументРеализации.Комментарий = Объект.Комментарий;
	объектСвязанныйДокументРеализации.Курс = ОбщийМодульСервер.ПолучитьТекущийКурс(объект.Валюта, объект.Дата);
	объектСвязанныйДокументРеализации.Организация = ПредопределенноеЗначение("Справочник.Организации.ОсновноеПредприятие");
	объектСвязанныйДокументРеализации.ПоступилоДенег = объект.ПоступилоДенег;
	объектСвязанныйДокументРеализации.Склад = объект.Склад;
	объектСвязанныйДокументРеализации.ХранилищеДенег = объект.ХранилищеДенег;
	для каждого СтрокаТовара из объект.Товары Цикл
		Если СтрокаТовара.КоличествоРазница < 0 Тогда
			Количество = -СтрокаТовара.КоличествоРазница;
			СтрокаРеализации = объектСвязанныйДокументРеализации.Товары.Добавить();
			СтрокаРеализации.Номенклатура      = СтрокаТовара.Номенклатура;
			СтрокаРеализации.СерияНоменклатуры = СтрокаТовара.СерияНоменклатуры;
			СтрокаРеализации.Количество		   = Количество;
			СтрокаРеализации.Цена              = ОбщийМодульСервер.ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, объект.ВидЦен, объект.Дата, ложь, Количество, , , , Объект.Ссылка);
			СтрокаРеализации.Сумма			   = СтрокаРеализации.Цена * Количество;
			СтрокаРеализации.ОСтроке = СтрокаТовара.Коментарий;
			
		КонецЕсли;	
	КонецЦикла;
	
	Попытка 
		объектСвязанныйДокументРеализации.Записать(РежимЗаписиДокумента.Проведение);
		объект.СвязанныйДокументРеализации = объектСвязанныйДокументРеализации.Ссылка;
		
	Исключение 	
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка при проведении документа реализации:") + " " + ОписаниеОшибки();
		//Сообщение.УстановитьДанные(Объект);
		//Сообщение.Сообщить();
		ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка при проведении документа реализации:") + " " + ОписаниеОшибки());
		
	КонецПопытки;
	
	ОбновитьВидимость();
	
КонецПроцедуры

Функция   ПроверитьНаличиеОприходования()
	
	ЕстьОприходование = Ложь;
	
	для каждого СтрокаТовара из объект.Товары Цикл
		Если СтрокаТовара.КоличествоРазница > 0 Тогда
			ЕстьОприходование = Истина;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Если ЕстьОприходование Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В документе есть строки с оприходованием. Их нельзя отразить в реализации!");
		Сообщение.Поле  = "Товары";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Возврат НЕ ЕстьОприходование;
	
КонецФункции //ПроверитьНаличиеОприходования

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если не отказ 
		и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Отказ = ПроверитьНаОтказ();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
процедура ПодготовкаКПроведению(Отказ)
	
	Если Не Отказ тогда
		ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
		ДокументОбъект.ПодготовкаКПроведению(Отказ);
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ПроверитьНаОтказ()
	
	отказ = ложь;
	
	//ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	//ДокументОбъект.ПодготовкаКПроведению(Отказ);
	//ЗначениеВРеквизитФормы(ДокументОбъект.Ссылка.ПолучитьОбъект(), "Объект");
	
	Ссылка = Объект.Ссылка;
	Валюта = Объект.Валюта;
	Дата   = Объект.Дата;
	видцен = Объект.ВидЦен;
	ХранилищеДенег = Объект.ХранилищеДенег;
	ВыбылоДенег    = объект.ВыбылоДенег;
	ПоступилоДенег = объект.ПоступилоДенег;	
	ОтразитьВЗаработнойПлате = Объект.ОтразитьВЗаработнойПлате;
	
	Если ЗначениеЗаполнено(видцен) Тогда
		Курс = ОбщийМодульПовтор.ПолучитьТекущийКурс(видцен.ВалютаЦены, Дата);
	Иначе
		Курс = 1;
	КонецЕсли;
	
	Если НЕ ОтразитьВЗаработнойПлате 
		и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег") Тогда
		
		ВалютаДок = ?(ЗначениеЗаполнено(Валюта), Валюта, ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта"));
		
		Если ЗначениеЗаполнено(ХранилищеДенег) Тогда
			ФормаОплаты = ХранилищеДенег.ФормаОплаты;
		Иначе
			ФормаОплаты = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ФормаОплатыДляДенегВДокументахРасходаИПриходаТоваров") ;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ФормаОплаты) Тогда
			ФормаОплаты = перечисления.ФормыОплаты.Наличные;
		КонецЕсли;
		
		СуммаДенег = ВыбылоДенег - ПоступилоДенег;
		если не СуммаДенег = 0 тогда
			Отказ = ОбщийМодульСервер.ПроверитьОстатокДенежныхСредств(СуммаДенег, Дата, ФормаОплаты, ВалютаДок, объект.ХранилищеДенег, , Объект.Ссылка);
		КонецЕсли;  	
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции //ПроверитьНаОтказ

&НаКлиенте
Процедура Валюта1ПриИзменении(Элемент)
	Валюта1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура Валюта1ПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ХранилищеДенег)
		и не объект.Валюта = объект.ХранилищеДенег.Валюта Тогда
		
		объект.ХранилищеДенег = ПредопределенноеЗначение("Справочник.ХранилищаДенег.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Валюта1ПриИзмененииНаСервере();
КонецПроцедуры
